ubiubiubi/iwasz-sandbox/trunk/tm4c123-drama-button-v2/src/main.c
                        // Send the data via endpoint 0.
                        USBDCDSendDataEP0 (0, reportDescriptor1, sizeof(reportDescriptor1));
                }
                else if (psUSBRequest->wIndex == 1) {
                        ui32Size = sizeof(reportDescriptor2);

                        // If there is more data to send than the host requested then just send the requested amount of data.
                        if (ui32Size > psUSBRequest->wLength) {
                                ui32Size = psUSBRequest->wLength;
                        }

                        // Send the data via endpoint 0.
                        USBDCDSendDataEP0 (0, reportDescriptor2, sizeof(reportDescriptor2));
                }
            break;
        }

        //
        // This is a request for the HID descriptor (as found in the
        // configuration descriptor following the relevant interface).
        //
        case USB_HID_DTYPE_HID:
        {

                if (psUSBRequest->wIndex == 0) {
                        ui32Size = sizeof(hidKeyboardDescriptor1);

                        if (ui32Size > psUSBRequest->wLength) {
                                ui32Size = psUSBRequest->wLength;
                        }
                        USBDCDSendDataEP0 (0, hidKeyboardDescriptor1, ui32Size);
                }
                else if (psUSBRequest->wIndex == 1) {
                        ui32Size = sizeof(hidKeyboardDescriptor2);

                        if (ui32Size > psUSBRequest->wLength) {
                                ui32Size = psUSBRequest->wLength;
                        }
                        USBDCDSendDataEP0 (0, hidKeyboardDescriptor2, ui32Size);
                }
            break;
        }

        //
        // This was an unknown request so stall.
        //
        default:
        {
            USBDCDStallEP0(0);
            break;
        }
    }
}

//*****************************************************************************
//
// This function is called by the USB device stack whenever a non-standard
// request is received.
//
// \param pvHIDInstance is the instance data for this HID device.
// \param psUSBRequest points to the request received.
//
// This call parses the provided request structure.  Assuming the request is
// understood, it is handled and any required response generated.  If the
// request cannot be handled by this device class, endpoint zero is stalled to
// indicate an error to the host.
//
//*****************************************************************************
static void onRequest(void *userData, tUSBRequest *psUSBRequest)
{
        printf ("onRequest bmRequestType:%x, bRequest:%x, wValue:%x, wIndex:%x, wLength:%x\r\n",
                psUSBRequest->bmRequestType,
                psUSBRequest->bRequest,
                psUSBRequest->wValue,
                psUSBRequest->wIndex,
                psUSBRequest->wLength);

    CallbackDTO *callbackDTO = (CallbackDTO *) userData;
    ASSERT(callbackDTO);

    //
    // Determine the type of request.
    //
    switch(psUSBRequest->bRequest)
    {
        //
        // A Get Report request is used by the host to poll a device for its
        // current state.
        // The only required request.
        case USBREQ_GET_REPORT:
        {
                printf ("set get report");
            //
            // Need to ACK the data on end point 0 in this case.
            //
            USBDevEndpointDataAck(USB0_BASE, USB_EP_0, true);

            //
            // ..then send back the requested report.
            //

            callbackDTO->requestPending = true;

            if (psUSBRequest->wIndex == 1) {
                USBDCDSendDataEP0 (0, callbackDTO->report1, REPORT1_SIZE);
            }
            if (psUSBRequest->wIndex == 2) {
                USBDCDSendDataEP0 (0, callbackDTO->report2, REPORT2_SIZE);
            }

            break;
        }

        //
        // This request was not recognized so stall.
        //
        default:
        {
            USBDCDStallEP0(0);
            break;
        }
    }
}

//*****************************************************************************
//
// Called by the USB stack for any activity involving one of our endpoints
// other than EP0.  This function is a fan out that merely directs the call to
// the correct handler depending upon the endpoint and transaction direction
// signaled in ui32Status.
//
//*****************************************************************************
static void onEndpointsActivity (void *userData, uint32_t ui32Status)
{
        printf ("onEndpointsActivity ui32Status : %x\r\n", ui32Status);

        CallbackDTO *callbackDTO = (CallbackDTO *) userData;
        ASSERT(callbackDTO);

        //
        // Handler for the interrupt IN data endpoint.
        //
//        if (ui32Status & (1 << USBEPToIndex(psInst->ui8INEndpoint))) {
//                ProcessDataToHost(pvHIDInstance, ui32Status);
//        }

#define ENDPOINT_1_IN (1 << 1)
#define ENDPOINT_2_IN (1 << 2)

        if (ui32Status & ENDPOINT_1_IN) {
//                ProcessDataToHost(callbackDTO, ui32Status);
        }
}

//*****************************************************************************
//
// Receives notifications related to data sent to the host.
//
// \param psHIDDevice is the device instance whose endpoint is to be processed.
// \param ui32Status is the USB interrupt status that caused this function to
// be called.
//
// This function is called from HandleEndpoints for all interrupts originating
// from the interrupt IN endpoint (in other words, whenever data has been
// transmitted to the USB host).  We examine the cause of the interrupt and,
// if due to completion of a transmission, notify the client.
//
// \return Returns \b true on success or \b false on failure.
//
//*****************************************************************************
//static bool
//ProcessDataToHost(CallbackDTO *callbackDTO, uint32_t ui32Status)
//{
//    tHIDInstance *psInst;
//    uint32_t ui32EPStatus;
//
//    //
//    // Get a pointer to our instance data.
//    //
//    psInst = &psHIDDevice->sPrivateData;
//
//    //
//    // Get the endpoint status to see why we were called.
//    //
//        ui32EPStatus = USBEndpointStatus(psInst->ui32USBBase, psInst->ui8INEndpoint);
//
//    //
//    // Clear the status bits.
//    //
//        USBDevEndpointStatusClear(psInst->ui32USBBase, psInst->ui8INEndpoint, ui32EPStatus);
//
//    //
//    // Our last packet was transmitted successfully.  Is there any more data to
//    // send or have we finished sending the whole report?  We know we finished
//    // if the ui16InReportIndex has reached the ui16InReportSize value.
//    //
//    if(psInst->ui16InReportSize == psInst->ui16InReportIndex)
//    {
//        //
//        // We finished sending the last report so are idle once again.
//        //
//        psInst->iHIDTxState = eHIDStateIdle;
//
//
//
////        //
////        // Do we have any reports to send as a result of idle timer timeouts?
////        //
////        if(psInst->ui16DeferredOpFlags & (1 << HID_DO_SEND_IDLE_REPORT))
////        {
////            //
////            // Yes - send reports for any timers that expired recently.
////            //
////            ProcessIdleTimers(psHIDDevice, 0);
////        }
//    }
//    else
//    {
//        //
//        // There must be more data or a zero length packet waiting to be sent
//        // so go ahead and do this.
//        //
//        scheduleReportTransmission(psInst);
//    }
//
//    return(true);
//}

//*****************************************************************************
//
// Schedule transmission of the next packet forming part of an input report.
//
// \param psHIDInst points to the HID device instance whose input report is to
// be sent.
//
// This function is called to transmit the next packet of an input report
// passed to the driver via a call to USBDHIDReportWrite.  If any data remains
// to be sent, a USB packet is written to the FIFO and scheduled for
// transmission to the host.  The function ensures that reports are sent as
// a sequence of full packets followed by either a single int16_t packet or a
// packet with no data to indicate the end of the transaction.
//
//*****************************************************************************
static int32_t scheduleReportTransmission (uint8_t *data, uint16_t len, uint32_t endpoint)
{
        int32_t i32Retcode;

        // Put the data in the correct FIFO.
        i32Retcode = USBEndpointDataPut(USB0_BASE, endpoint, data, len);

        if (i32Retcode != -1) {
                // Send out the current data.
                i32Retcode = USBEndpointDataSend(USB0_BASE, endpoint, USB_TRANS_IN);
        }

        //
        // Tell the caller how we got on.
        //
        return (i32Retcode);
}

/**
 *
 */
uint32_t reportWrite (CallbackDTO *callbackDTO, uint8_t *data, uint16_t length, uint32_t endpoint)
{
        ASSERT(callbackDTO);
        printf ("reportWrite dataLen : %d, \r\n");

