ubiubiubi/iwasz-sandbox/trunk/tm4c123-drama-button-v2/src/main.c
        // Set a flag indicating that we are currently in the process of sending
        // a packet.
        callbackDTO->bSendInProgress = true;

        //
        // Can we send the data provided?
        //
        if (callbackDTO->iHIDTxState != eHIDStateIdle) {
                //
                // We are in the middle of sending another report.  Return 0 to
                // indicate that we can't send this report until the previous one
                // finishes.
                //
                callbackDTO->bSendInProgress = false;
                return (0);
        }

//    //
//    // Clear the elapsed time since this report was last sent.
//    //
//    if(ui32Length)
//    {
//        ClearReportTimer(pvHIDInstance, *data);
//    }

        //
        // Schedule transmission of the first packet of the report.
        //
        callbackDTO->iHIDTxState = eHIDStateWaitData;
        uint32_t i32Retcode = scheduleReportTransmission(data, length, endpoint);

        //
        // Clear the flag we use to indicate that we are in the midst of sending
        // a packet.
        //
        callbackDTO->bSendInProgress = false;

        //
        // Did an error occur while trying to send the data?
        //
        if (i32Retcode != -1) {
                //
                // No - tell the caller we sent all the bytes provided.
                //
                return (length);
        } else {
                //
                // Yes - tell the caller we could not send the data.
                //
                return (0);
        }
}

/*##########################################################################*/

static tDeviceInfo deviceInfo;

void UARTStdioConfig (uint32_t ui32PortNum, uint32_t ui32Baud, uint32_t ui32SrcClock)
{
        //
        // Check the arguments.
        //
        ASSERT((ui32PortNum == 0) || (ui32PortNum == 1) ||
                        (ui32PortNum == 2));

        //
        // Check to make sure the UART peripheral is present.
        //
        if (!SysCtlPeripheralPresent(SYSCTL_PERIPH_UART0)) {
                return;
        }

        //
        // Enable the UART peripheral for use.
        //
        SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);

        //
        // Configure the UART for 115200, n, 8, 1
        //
        UARTConfigSetExpClk(UART0_BASE, ui32SrcClock, ui32Baud, (UART_CONFIG_PAR_NONE | UART_CONFIG_STOP_ONE |
        UART_CONFIG_WLEN_8));

        //
        // Enable the UART operation.
        //
        UARTEnable(UART0_BASE);
}

void ConfigureUART (void)
{
        //
        // Enable the GPIO Peripheral used by the UART.
        //
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);

        //
        // Enable UART0
        //
        SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);

        //
        // Configure GPIO Pins for UART mode.
        //
        GPIOPinConfigure(GPIO_PA0_U0RX);
        GPIOPinConfigure(GPIO_PA1_U0TX);
        GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);

        //
        // Use the internal 16MHz oscillator as the UART clock source.
        //
        UARTClockSourceSet(UART0_BASE, UART_CLOCK_PIOSC);

        //
        // Initialize the UART for console I/O.
        //
        UARTStdioConfig(0, 115200, 16000000);
}


/**
 *
 */
int main (void)
{
        SysCtlClockSet (SYSCTL_SYSDIV_4 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN | SYSCTL_XTAL_16MHZ);

        ConfigureUART ();
        printf ("tm4c123-drama-button starts\r\n");

        // Enable the GPIO port that is used for the on-board LED.
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
        GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3);


        // USB config : Enable the GPIO peripheral used for USB, and configure the USB pins.
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
        SysCtlGPIOAHBEnable(SYSCTL_PERIPH_GPIOD);
        GPIOPinTypeUSBAnalog(GPIO_PORTD_AHB_BASE, GPIO_PIN_4 | GPIO_PIN_5);

        ButtonsInit();
        RGBInit(0);

        /****************************************************************************/

        CallbackDTO callbackDTO;
        callbackDTO.deviceInfo = &deviceInfo;
        callbackDTO.requestPending = false;
        callbackDTO.bSendInProgress = false;
        callbackDTO.iHIDTxState = eHIDStateIdle; // TODO. To powinno być  na początku "unconfigured"

        deviceInfo.psCallbacks = &handlers; //???
        deviceInfo.pui8DeviceDescriptor = deviceDescriptor;
        deviceInfo.ppsConfigDescriptors = configHeaders;
        deviceInfo.ppui8StringDescriptors = stringDescriptors;
        deviceInfo.ui32NumStringDescriptors = NUM_STRING_DESCRIPTORS;
        USBDCDDeviceInfoInit (0, &deviceInfo);
//        InternalUSBTickInit();

        USBStackModeSet(0, eUSBModeForceDevice, 0);
        USBDCDInit (0, &deviceInfo, &callbackDTO);
//        GPIOPinWrite (GPIO_PORTF_BASE, GPIO_PIN_2, GPIO_PIN_2);

        uint32_t ui32Loop;
        uint8_t ui8ButtonsChanged, ui8Buttons;
        uint32_t color1[3] = { 0xffffu, 0x0000u, 0x0000u };
        uint32_t color2[3] = { 0x0000u, 0xffffu, 0x0000u };

        // Wait until device gets configured
        for (int i = 0; i < 100000; ++i) {
                ;
        }

        while (1) {
                ButtonsPoll(&ui8ButtonsChanged, &ui8Buttons);


//                if(ui8Buttons & RIGHT_BUTTON)
//                {
//                        RGBSet (color2, 0.01);
//                        RGBEnable();
//                }
//                else {
//                        RGBDisable ();
//                }

                if (ui8ButtonsChanged) {


                        // TODO obdługa zupełnie inaczej.
                        if(ui8Buttons & LEFT_BUTTON)
                        {
                                RGBSet(color1, 0.01);
                                RGBEnable();
                                callbackDTO.report1[0] = 0x00;
                                callbackDTO.report1[1] = 0x00;
                                callbackDTO.report1[2] = 0x04;

//                                callbackDTO.report2[0] = 0x10;
                        }
                        else {
                                RGBDisable ();
                                for (int i = 0; i < REPORT1_SIZE; ++i) {
                                        callbackDTO.report1[i] = 0x00;
                                }

                                for (int i = 0; i < REPORT2_SIZE; ++i) {
                                        callbackDTO.report2[i] = 0x00;
                                }
                        }


                        if (callbackDTO.iHIDTxState == eHIDStateIdle) {
                                // Send the report to the host.
                                uint32_t ui32Count = reportWrite (&callbackDTO, callbackDTO.report1, REPORT1_SIZE, USB_EP_1);

                                if (ui32Count != 0) {
//                                        callbackDTO.bChangeMade = false;
                                }
                        }
                        else
                        {
                            // We can't send the report immediately so mark the instance so that
                            // it is sent next time the transmitter is free.
//                            callbackDTO.bChangeMade = true;
                        }
                }

                for (int i = 0; i < 10000; ++i) {
                        ;
                }
        }
}

